//Problem 1. Odd or Even Integers

//Write an expression that checks if given integer is odd or even.
//Examples:

//n	Odd?
//3	true
//2	false
//-2	false
//-1	true
//0	false

//ВНИМАНИЕ КОЛЕГИ ПРОВЕРЯВАЩИ!!!!
//МОЛЯ, не ми обяснявайте, че трябва да трия namespace-а, защото така са казали на лекциите. Не е грешно, а дори е по-правилно. Просто за сега не би трябвало да ни интересува, но се опитвам да свикна по този начин, защото в един момен ще трябва да се прави така. using System;, също е на мястото си!! Отнася се за всички задачи от домашното.
//Извинявам се на хората, които нямат нужда от пояснение, но има и хора на които може и да им е полезно :)
//И още нещо - в архива с домашното са махнати bin и obj папките. Ако след като отворите солюшъна тези папки са в разархивираната директория на домашното - ами те се генерират автоматично след отварянето на .sln файла и компилирането на програмите. Вижте в архива дали ги има :)
//Пиша това с цел да не ми се налага да оценявам коментари, като НЕ полезни, а не за да се заяждам или нещо подобно :)
//Приятно оценяване и успех в академията!!!!


namespace OddOrEvenIntegers
{
    using System;

    class OddOrEvenIntegers
    {
        static void Main()
        {
            Console.Write("Please enter integer number to check: ");
            int number = int.Parse(Console.ReadLine());
            bool isOdd = number % 2 != 0;
            Console.WriteLine("Is it odd?: {0}", isOdd);

        }
    }
}
